Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.shared_file will be created
+ resource "local_file" "shared_file" {
      + content              = "This is a shared resource owned by repo-a."
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/tmp/shared.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Inspecting Atlantis plan for deletions...
Notification completed.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://illustration-finder-field-planned.trycloudflare.com/lock?id=moss2k13%252Fatlantis-1%252Finfrastructure%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infrastructure
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```